#!/usr/bin/python
# -*- coding: utf-8 -*-

import sys
sys.path.append('../server/src')

import msgpack
from service_forward import open_forward, open_client, objectid2string, string2objectid

roles = [
	('game.kr.1',	[10706,13912,15624,16472,16879,16940,19062,20448,24393,24551,27518,29364,29712,32555,]),
	('game.kr.10',	[10055,11203,12619,15331,]),
	('game.kr.11',	[11835,16704,]),
	('game.kr.12',	[10488,10666,11414,13521,14932,16880,]),
	('game.kr.13',	[12284,15107,15173,]),
	('game.kr.14',	[10038,11783,12087,12643,14201,14371,]),
	('game.kr.15',	[13096,15788,]),
	('game.kr.16',	[11594,12494,16051,]),
	('game.kr.17',	[11111,]),
	('game.kr.18',	[10219,10225,12774,15132,16764,18344,18758,]),
	('game.kr.19',	[10155,10182,11962,12275,12592,12681,15157,16774,]),
	('game.kr.2',	[10299,10713,10800,]),
	('game.kr.20',	[10289,10642,12906,14823,]),
	('game.kr.21',	[13879,14146,14963,17021,18300,]),
	('game.kr.22',	[10207,10482,10866,14935,18730,]),
	('game.kr.23',	[10028,11516,11645,12585,]),
	('game.kr.24',	[10402,11243,16210,]),
	('game.kr.25',	[10238,10729,11213,14025,]),
	('game.kr.26',	[10022,11358,15510,]),
	('game.kr.28',	[14030,14891,]),
	('game.kr.29',	[10379,10627,11236,12219,15776,]),
	('game.kr.3',	[10208,11440,12165,12482,22737,25036,27464,27943,]),
	('game.kr.30',	[12240,12372,]),
	('game.kr.31',	[10311,11945,18068,]),
	('game.kr.32',	[11172,]),
	('game.kr.33',	[13231,]),
	('game.kr.34',	[14042,14566,]),
	('game.kr.4',	[12316,14647,15126,]),
	('game.kr.5',	[13950,14289,21615,]),
	('game.kr.6',	[10033,12187,12725,16799,]),
	('game.kr.7',	[11253,11685,11802,13262,]),
	('game.kr.8',	[12709,13549,15977,17217,20279,]),
	('game.kr.9',	[12471,13202, ]),
]

def online():
	total = len(roles)
	with open_client('kr') as client:
	# with open_forward('kr') as client:
		attachs = {}
		for key, v in roles:
			for roleid in v:
				sender = '비서'
				subject = '구글 결제 악용 2차 통보'
				content = '안녕하세요,트레이너님. 확인 결과 트레이너님께서 정상적으로 이루어진 결제건에 대해 저희측에 환불 신청 및 아이테 회수 없이 구글측으로부터 자체 환불을 받은 것으로 확인되었습니다. 게임 공평성을 위해 결제후 게임을 이용하는 유저분들한테 극대한 피해를 주는 행위로 자체 환불을 진행하여 결제악용으로 인해 계정 정지 대상으로 간주되었습니다. 제재 리스트에 제외 원하시면 최대한 빨리 고객센터로 연락해주시기 바라며 자체 환불 금액을 재결제 해주시기 바랍니다. 1월15일 17시까지재결제 하지 않으실 경우 계정 이용 제한 조치가 취해질 수 있습니다.협조 부탁드립니다.'
				resp = client.call('gmSendMail', roleid, 1, sender, subject, content, attachs, service_id=key)
				print key, roleid, attachs, resp
				if resp != True:
					raise Exception('send error')


if __name__ == "__main__":
	online()
